Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnFace_t
Struct for a tolerated point on a face.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnFace_t.Id
ID of the object on which the tolerated point exists.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnFace_t.SubId
SubID of the object on which the tolerated point exists.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnFace_t.ObjectType
Object type of the object on which the tolerated point exists.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnFace_t.HitPoint
The tolerated point.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnFace_t.HitPointNormal
The normal of the face.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnFace_t.FaceVisibilty
The visibility of the face.